Revit 2016 API
ExternalServices.BuiltInExternalServices Properties
The ExternalServices.BuiltInExternalServices type exposes the following members.
Properties
Name | Description
CodeCheckingParameterService
 The external service supporting view and modification of the structural code checking parameter in analytical elements.
DuctFittingAndAccessoryPressureDropService
 The external service Id which permits registration of an alternate implementation for duct fitting and accessory pressure drop calculation.
DuctFittingAndAccessoryPressureDropUIService
 The external service which permits registration of an alternate implementation for a duct fitting and accessory pressure drop calculation UI.
DuctPressureDropService
 The external service which permits registration of an alternate implementation for duct pressure drop calculation.
ExternalResourceService
 The external service Id which permits registration of an alternate servers for managing external resources such as linked files.
ExternalResourceUIService
 The external UI service Id which permits registration of an alternate servers for managing error messages which happen at the loading of the references to external resources such as linked files.
IFCExporterService
 The external service which permits registration of an alternate implementation for IFC export.
IFCImporterService
 The external service which permits registration of an alternate implementation for IFC import.
MemberForcesService
 The external service supporting view and modification of the member forces in analytical elements.
NavisworksExporterService
 The external service which supports export of the model to Navisworks.
PipeFittingAndAccessoryPressureDropService
 The external service which permits registration of an alternate implementation for pipe fitting and accessory pressure drop calculation.
PipeFittingAndAccessoryPressureDropUIService
 The external service which permits registration of an alternate implementation for a pipe fitting and accessory pressure drop calculation UI.
PipePlumbingFixtureFlowService
 The external service which permits registration of an alternate implementation for pipe fixture flow calculation.
PipePressureDropService
 The external service which permits registration of an alternate implementation for pipe pressure drop calculation.
SnappingService
StructuralSectionsService
 The external service supporting view and modification of the structural sections shape in structural elements.
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace